import {IИме} from "./слова-типови";

export const имена: IИме[] = [
	// Ми
	{
		текст: "Анастасија",
	},
	{
		текст: "Симеон",
	},

	// Ања
	{
		текст: "Соња",
	},
	{
		текст: "Борја",
	},

// Чики
	{
		текст: "Стеван",
	},
	{
		текст: "Марта",
	},

// Мирко и Невена
	{
		текст: "Ксенија",
	},
	{
		текст: "Тијана",
	},
	{
		текст: "Вукашин",
	},

// Оливера и Влада
	{
		текст: "Стефан",
	},
	{
		текст: "Андреј",
	},
	{
		текст: "Теодора",
	},

// Марко и Ивана
	{
		текст: "Лука",
	},

// Вељко Палија
	{
		текст: "Стефан",
	},
	{
		текст: "Мила",
	},

// Лидија и Борис
	{
		текст: "Марко",
	},
	{
		текст: "Мина",
	},

// Синиша и Роза
	{
		текст: "Малише",
	},

// Миљенко

// Синиша Манојловић

// Гале и 
	{
		текст: "Томислав",
	},

// Перо и Сања
	{
		текст: "Лана",
	},

// Норич
{
	текст: "Патриција",
},

// Марини, ?! Мики?

// Лиза

// Лео

];
