import { IPoint } from "./свг-алати";
export interface ISlovo {}

/**
 * Информације о спловима описаним у СВГ фајлу
 */
export interface IСлова {
	/** Подаци о СВГ-у */
	свг: {
		/** x-позиција СВГа */
		x: number;
		/** y-позиција СВГа */
		y: number;
		/** ширина СВГ-а */
		width: number;
		/** висина СВГ-а */
		height: number;
	};
	/** Подаци о словима */
	слова: {
		/** помјерај равни са словима (предат кроз `translate` параметар) */
		помјерај: IPoint;
		/** листа СВГ описа свих слова
		 * Сваки елемент садржи појединачно слово описано у СВГ-у
		 * Сваки слово има више елемената који су описани лабелама:
		 * + само слово
		 * + везе слова са носачима
		 * + позадину слова која дефинише димензије слова (како би се слова могла сложити како треба)
		 */
		словаСвг: unknown[];
		/** тренутно се не користи, вјероватно је идеја да се кроз њега мапирају појединачне особине сваког од слова */
		slova: Record<string, ISlovo>;
	};
	/**
	 * XML садржај учитаног СВГ фајла са словима
	 */
	xmlСаСловима: any;
}

/** Описује једно име додано (или које се додаје) у СВГ */
export interface IИме {
	/** садржи текст имена */
	текст: string;
	/** референца на СВГ објекат садржитељ имена  */
	свгСадржитељ?: any;
	/** позиција гдје треба да се позиционира име */
	позиција?: IPoint;
}

/**
 * Описује шта од слова треба да се дода у СВГ фајл
 */
export enum EШтаДодатиОдСловаУФајл {
	ДОДАЈ_ЛИНИЈЕ = "ДОДАЈ_ЛИНИЈЕ",
	ДОДАЈ_СЛОВО = "ДОДАЈ_СЛОВО",
	ДОДАЈ_СВЕ = "ДОДАЈ_СВЕ",
}